//Составить программу вывода на экран числа, 
//вводимого с клавиатуры.
//Выводимому числу должно предшествовать сообщение 
//«Вы ввели число».

// Console.WriteLine("Введите число");
// string number = Console.ReadLine();
// Console.WriteLine($"Вы ввели число: {number}");

int i = 0;

while(i < 10)
{
    i + 2;
    Console.WriteLine(i);
}



