// Почувствуй себя мидлом*
// 23. Показать таблицу квадратов чисел от 1 до N
// 24. Найти кубы чисел от 1 до N
// 25. Найти сумму чисел от 1 до А
// 26. Возведите число А в натуральную степень B используя цикл
// 27. Определить количество цифр в числе
// 28. Подсчитать сумму цифр в числе
// 29. Написать программу вычисления произведения чисел от 1 до N
// 30. Показать кубы чисел, заканчивающихся на четную цифру

// ========================== Задача 23 ===========================
// Показать таблицу квадратов чисел от 1 до N

// Console.WriteLine("Введите число N");

// int n = Convert.ToInt16(Console.ReadLine());
// int Square(int n)
// {
//     for (int i = 1; i <= n; i++)
//     {
//         Console.Write($"| {i,2}  | {Math.Pow(i,2),2}  |");
//         Console.WriteLine();
//     }
//     return n;
// }
// Square(n);

// ========================== Задача 24 ===========================
// Найти кубы чисел от 1 до N

// Console.WriteLine("Введите число N"); 
// int n = Convert.ToInt16(Console.ReadLine());
// int Square(int n)
// {
//     for (int i = 1; i <= n; i++)
//     {
//         Console.Write($"| {i,2}  | {Math.Pow(i,3),2}  |");
//         Console.WriteLine();
//     }
//     return n;
// }
// Square(n);


// ========================== Задача 25 ===========================
// 25. Найти сумму чисел от 1 до А

// int Summ(int A)
// {
//     int result = 0;
//     for (int i = 0; i <= A; i++)
//     {
//         result = result + i;
//     }
//     return result;
// }
// Console.WriteLine(Summ(6));

// ========================== Задача 26 ===========================
// 26. Возведите число А в натуральную степень B используя цикл
int Stepen(int a, int b)
{
    int result = a;
    for (int i = 1; i <= b; i++)
    {
        result = 
    }
    return result;
}
System.Console.WriteLine(Stepen(2,3));
